cf_billing/Documents/бестСуточнаяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестСуточнаяВедомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестИтоговыеЗначенияПараметровСуточнойВедомости</xr:Item>
				<xr:Item>AccumulationRegister.бестОбъемНачисленийНП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНастроекЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестШаблоныЗагрузокСуточнойВедомости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыИзмерителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестВидыПараметровИзмерителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВремя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BНP</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BOC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестПараметрыИзмерителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПараметрыИзмерителей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестВидыПараметровИзмерителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасположениеИзмерителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргРасположениеИзмерителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТемпературы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыТемператур</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Измеритель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/бестШаблоныЗагрузокСуточнойВедомости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бестШаблоныЗагрузокСуточнойВедомости</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПрибораУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТипыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечнаяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатическиеКолонки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДинамическиеКолонки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитТЧ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестВидыПараметровИзмерителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/бестСуточнаяВедомость/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргКарточкаАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Карточка абонента'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";	
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.Рассчитать;
	//
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Предполагаемые начисления'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.ВидРасчета;
		
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);

КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	состав команд.
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * Обработчик										-	Строка	-	"ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьГруппуПотребителейАбонента"
//     * Идентификатор									-	Строка	-	"ПерерасчетНаОснованиииУстановитьГруппуПотребителейАбонента"
//     * Представление									-	Строка	-	"Пперерасчет"
//     * ПроверкаПроведенияПередСозданиемНаОсновании	-	Булево
//     
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииУстановитьГруппуПотребителейАбонента(КомандыСоздатьНаОсновании);

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьПоРегистру(ТаблицаПараметрыИзмерителя,ПриборУчета) Экспорт 
	
	РезультатЗапроса 	= РегистрыСведений.бестПараметрыИзмерителей.ВернутьПараметрыИзмерителя(ПриборУчета);
	
	ТипДляКолонки 		= Новый ОписаниеТипов("СправочникСсылка.бестВидыПараметровИзмерителей");
	Выборка 			= РезультатЗапроса.Выбрать();
	МодульДок			= Документы.бестСуточнаяВедомость; 	
	
	Пока Выборка.Следующий() Цикл
		ИмяКолонки 	= МодульДок.СформироватьИмяКолонки(Выборка.ВидПараметра); 		
		 
		ТаблицаПараметрыИзмерителя.Колонки.Добавить(ИмяКолонки,ТипДляКолонки,Выборка.ВидПараметра);
	КонецЦикла;
	           
КонецПроцедуры

#Область РАБОТА_С_КОЛОНКАМИ

Функция СформироватьИмяКолонки(ВидПараметра) Экспорт 
	ИмяКолонки 	= "Колонка";//СтрЗаменить(ВидПараметра," ","");
	ИденКолонки = СтрЗаменить(Строка(ВидПараметра.УникальныйИдентификатор()),"-","_");
	
	ИмяКолонки 	= ИмяКолонки + "_1_" + ИденКолонки;
	
	Возврат ИмяКолонки;
КонецФункции

// Описание полей
// ВыводитьВТЧ - необходим для справочника с настройками шаблонов
Функция ПолучитьСтатическиеКолонки() Экспорт
	
	МассивКолонок 		= ПолучитьМассивСтатическихКолонок();
	СтатическиеКолонки 	= Новый Соответствие;	
	
	Для Каждого ТекСтрока Из МассивКолонок Цикл
		СтруктураСтроки = Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,ТекСтрока);
		СтатическиеКолонки.Вставить(ТекСтрока.Имя,СтруктураСтроки);
	КонецЦикла;
	
	Возврат СтатическиеКолонки;
КонецФункции

Функция ПолучитьМассивСтатическихКолонок() Экспорт
	
	СтатическиеКолонки = Новый Массив;	
	СтатическиеКолонки.Добавить(Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","IDСтроки"	,ОбщегоНазначения.ОписаниеТипаСтрока(36)				,Тип("УникальныйИдентификатор")	,"IDСтроки" 	,Ложь));
	СтатическиеКолонки.Добавить(Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","ДатаВремя"	,ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя)	,Тип("Дата")					,"Дата время"	,Истина));
	СтатическиеКолонки.Добавить(Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","BНP"		,ОбщегоНазначения.ОписаниеТипаЧисло(15)					,Тип("Число")					,"BНP"			,Истина));
	СтатическиеКолонки.Добавить(Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","BOC"		,ОбщегоНазначения.ОписаниеТипаЧисло(15)					,Тип("Число")					,"BOC"			,Истина));
	
	Возврат СтатическиеКолонки;
КонецФункции

Функция ПолучитьЭлементСправочникаПоКолонке(Имя,ПустойПараметр,МодульСпр) Экспорт
	МассивПодстрок 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Имя,"_1_",Истина);
	ВидПараметра  	= ПустойПараметр;
	Если МассивПодстрок.количество() > 0 Тогда
		Попытка
			ВидПараметра = МодульСпр.ПолучитьСсылку(новый УникальныйИдентификатор(СтрЗаменить(МассивПодстрок[1],"_","-")));
		Исключение
			ВидПараметра  	= ПустойПараметр;
		КонецПопытки; 
	КонецЕсли;
	
	Возврат ВидПараметра
КонецФункции
	
#КонецОбласти

Функция ПолучитьСоотвествияКолонок(Шаблон) Экспорт 	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестШаблоныЗагрузокСуточнойВедомостиСтатическиеКолонки.РеквизитТЧ КАК РеквизитТЧ,
		|	бестШаблоныЗагрузокСуточнойВедомостиСтатическиеКолонки.НомерКолонки КАК НомерКолонки,
		|	""Статика"" КАК ВидКолонки
		|ПОМЕСТИТЬ ВТ_НастройкиЗаполнения
		|ИЗ
		|	Справочник.бестШаблоныЗагрузокСуточнойВедомости.СтатическиеКолонки КАК бестШаблоныЗагрузокСуточнойВедомостиСтатическиеКолонки
		|ГДЕ
		|	бестШаблоныЗагрузокСуточнойВедомостиСтатическиеКолонки.Ссылка = &Шаблон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестШаблоныЗагрузокСуточнойВедомостиДинамическиеКолонки.РеквизитТЧ,
		|	бестШаблоныЗагрузокСуточнойВедомостиДинамическиеКолонки.НомерКолонки,
		|	""Динамика""
		|ИЗ
		|	Справочник.бестШаблоныЗагрузокСуточнойВедомости.ДинамическиеКолонки КАК бестШаблоныЗагрузокСуточнойВедомостиДинамическиеКолонки
		|ГДЕ
		|	бестШаблоныЗагрузокСуточнойВедомостиДинамическиеКолонки.Ссылка = &Шаблон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НастройкиЗаполнения.РеквизитТЧ КАК РеквизитТЧ,
		|	ВТ_НастройкиЗаполнения.НомерКолонки КАК НомерКолонки,
		|	ВТ_НастройкиЗаполнения.ВидКолонки КАК ВидКолонки
		|ИЗ
		|	ВТ_НастройкиЗаполнения КАК ВТ_НастройкиЗаполнения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидКолонки,
		|	НомерКолонки
		|ИТОГИ ПО
		|	ВидКолонки";
	
	Запрос.УстановитьПараметр("Шаблон",Шаблон);
	
	РезультатЗапроса 	= Запрос.Выполнить();
	
	Статика 			= Новый Соответствие;
	Динамика 			= Новый Соответствие;
	
	ВыборкаВидКолонки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВидКолонки.Следующий() Цикл		
	
		Детальные = ВыборкаВидКолонки.Выбрать();
		
		ЭтоСтатика = ВыборкаВидКолонки.ВидКолонки = "Статика";
		
		Пока Детальные.Следующий() Цикл
			Если ЭтоСтатика Тогда
				Статика.Вставить(Детальные.НомерКолонки,Детальные.РеквизитТЧ);
			Иначе				
				Динамика.Вставить(Детальные.НомерКолонки,Детальные.РеквизитТЧ);
			КонецЕсли;		
		КонецЦикла;
	КонецЦикла;
	
	
	Возврат Новый Структура("Статика,Динамика",Статика,Динамика);
	
КонецФункции

#Область ЗАГРУЗКА_ИЗ_ФАЙЛОВ

//ПОЛУЧЕНИЕ ДАННЫХ ИЗ ФАЙЛА
#Область EXEL

Функция ВернутьДанныеИзФайла(ПутьКФайлу,ШаблонНастроекЗагрузки) Экспорт
	
	Таблица = новый ТаблицаЗначений;
	
	// Попытка открытия файла Excel
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ПутьКФайлу);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='При открытии файла произошла ошибка! Операция прервана!'"));
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Таблица;
	КонецПопытки;
	
	// Попытка выбрать первый лист
	Попытка 
		Excel.Sheets(1).Select();    
	Исключение
		// Закрытие файла в том случае, если первый лист не найден
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Первый лист не найден!'"));
		ОтменитьТранзакцию();
		Возврат Таблица;
	КонецПопытки;
	
	// Получим количество строк и колонок.
	// В разных версиях Excel получаются по-разному, поэтому сначала определим версию Excel
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок 	= Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок 	= Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;
	Конецесли;
	
	Сч = 1;
	Пока ЗначениеЗаполнено(Excel.Cells(1, Сч).Text) Цикл
		ИмяКолонки 		= Excel.Cells(1, Сч).Text;
		ИмяБезПробелов 	= "Колонка" + Сч; //СтрЗаменить(ИмяКолонки," ",""); 
		Таблица.Колонки.Добавить(ИмяБезПробелов,,Строка(Сч));		
		Сч = Сч + 1;
	КонецЦикла;
	
	НачальнаяСтрока = ?(ШаблонНастроекЗагрузки.НачальнаяСтрока > 0 ,ШаблонНастроекЗагрузки.НачальнаяСтрока,2); 
	ФайлСтрок 		= ?(ШаблонНастроекЗагрузки.КонечнаяСтрока > 0  ,ШаблонНастроекЗагрузки.КонечнаяСтрока ,ФайлСтрок);
	
	Для НС = НачальнаяСтрока по ФайлСтрок Цикл 	
		
		НоваяСтрока = Таблица.Добавить();
		
		Для НомерКолонки = 1 по Таблица.Колонки.Количество() Цикл
			// заполняем строку значениями
			ТекущееЗначение 		= Excel.Cells(НС, НомерКолонки).Text;
			ИмяКолонки 				= Таблица.Колонки[НомерКолонки-1].Имя;
			НоваяСтрока[ИмяКолонки] = ТекущееЗначение;
		КонецЦикла;
		
	КонецЦикла;
	
	Excel.DisplayAlerts = 0; 
	Excel.Quit();
	Excel.DisplayAlerts = 1;
	
	Возврат Таблица;
КонецФункции

Процедура ЗагрузитьДанныеИзФайла(ПутьКФайлу, Шаблон, ТабЧасть) Экспорт
	ДанныеДляЗагрузки  	= ВернутьДанныеИзФайла(ПутьКФайлу,Шаблон);
	
	ЗаполнитьДанныеИзФайлаВТЧ(ДанныеДляЗагрузки, Шаблон, ТабЧасть);	
КонецПроцедуры

#КонецОбласти

#Область TXT

Функция ВернутьДанныеИзTXTФайла(ПутьКФайлу,ШаблонНастроекЗагрузки) Экспорт
	
	Текст = Новый ТекстовыйДокумент;	
	Текст.Прочитать(ПутьКФайлу);
	
	Таблица 		= Новый ТаблицаЗначений;
	СоздатьКолонки 	= Истина;
	
	НачальнаяСтрока = ?(ШаблонНастроекЗагрузки.НачальнаяСтрока > 0 ,ШаблонНастроекЗагрузки.НачальнаяСтрока,2); 
	ФайлСтрок 		= ?(ШаблонНастроекЗагрузки.КонечнаяСтрока > 0  ,ШаблонНастроекЗагрузки.КонечнаяСтрока ,Текст.КоличествоСтрок());
	
	Для НомерСтроки = НачальнаяСтрока По ФайлСтрок Цикл		
		
		СтрокаДляПарсинга = Текст.ПолучитьСтроку(НомерСтроки);
		Если СоздатьКолонки Тогда
			// Первая строка должна быть первой строкой данных!
			// При первом заходе формируем по первой строке колонки таблицы!
			СтрокаДляКолонок = СтрокаДляПарсинга;
			Сч = 1;
			Пока СтрокаДляКолонок <> "" Цикл	
				Позиция			= Найти(СтрокаДляКолонок, "|");
				Если Позиция = 0 Тогда
					Прервать;
				КонецЕсли;			
				СтрокаДляКолонок = СокрЛП(Сред(СтрокаДляКолонок, Позиция + 1));
				
				ИмяБезПробелов 	= "Колонка" + Сч; 
				Таблица.Колонки.Добавить(ИмяБезПробелов,,Строка(Сч));		
				Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;		
		
		СоздатьКолонки 	= Ложь;
		НомерКолонки 	= 1;
		
		Пока СтрокаДляПарсинга <> "" Цикл 			
			Позиция			= Найти(СтрокаДляПарсинга, "|");
			Если Позиция = 0 Тогда
				// В данной строке нет колонок
				Прервать;
			ИначеЕсли НомерКолонки = 1 Тогда
				// В этом условии потому что есть строки с промежуточными итогами и они отделены ненужной строкой
				НоваяСтрока 	= Таблица.Добавить();
			КонецЕсли;
			
			// Обрезаем строку
			ДанныеКолонки 		= Сред(СтрокаДляПарсинга, 1, Позиция-1);	
			СтрокаДляПарсинга	= СокрЛП(Сред(СтрокаДляПарсинга, Позиция + 1));
			
			// Получаем имя колонки
			ИмяКолонки 				= Таблица.Колонки[НомерКолонки-1].Имя;
			НоваяСтрока[ИмяКолонки] = ДанныеКолонки;			
			
			НомерКолонки 	= НомерКолонки + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Процедура ЗагрузитьДанныеИзФайлаTXT(ПутьКФайлу, Шаблон, ТабЧасть) Экспорт
	ДанныеДляЗагрузки  	= ВернутьДанныеИзTXTФайла(ПутьКФайлу,Шаблон);
	
	ЗаполнитьДанныеИзФайлаВТЧ(ДанныеДляЗагрузки, Шаблон, ТабЧасть);	
КонецПроцедуры

#КонецОбласти

//ЗАПОЛНЕНИЕ ДАННЫХ ИЗ ФАЙЛА
Процедура ЗаполнитьДанныеИзФайлаВТЧ(Данные, Шаблон, ТабЧасть) Экспорт
	
	Если Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Данные) = тип("Массив") Тогда
		ДанныеДляЗагрузки = ПреобразоватьМассивВТаблицу(Данные);
	Иначе 
		ДанныеДляЗагрузки = Данные;
	КонецЕсли;	
	
	СоотвествияКолонок 	= ПолучитьСоотвествияКолонок(Шаблон);
	СтатическиеКолонки 	= Документы.бестСуточнаяВедомость.ПолучитьСтатическиеКолонки();
	МодульСпр			= Справочники.бестВидыПараметровИзмерителей;
	ПустойВидПараметра	= МодульСпр.ПустаяСсылка();
	
	Статика  			= СоотвествияКолонок.Статика;
	Динамика 			= СоотвествияКолонок.Динамика;
	
	Колонки 			= ДанныеДляЗагрузки.Колонки;
	
	Для Каждого ТекСтрока из ДанныеДляЗагрузки Цикл
		
		ЗначенияСтатическихКолонок 	= ЗаполнитьСтатическиеРеквизиты(СтатическиеКолонки,Статика,Колонки,ТекСтрока);	
		
		// Заполняем динамические данные
		Для Каждого ТекСоответДин из Динамика Цикл
			Попытка
				Значение = ТекСтрока["Колонка" + ТекСоответДин.Ключ];
				
				НоваяСтрока 				= ТабЧасть.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ЗначенияСтатическихКолонок);				
				НоваяСтрока.ВидПараметра 	= ТекСоответДин.Значение;
				НоваяСтрока.Значение 		= Значение;
			Исключение
			КонецПопытки; 			
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПреобразоватьМассивВТаблицу(ДанныеДляЗагрузки)	
	ТЗ 	= новый ТаблицаЗначений;
	
	Для Каждого ТекСтр из ДанныеДляЗагрузки Цикл
		Для Каждого ТекЭлем Из ТекСтр Цикл			
			ТЗ.Колонки.Добавить(ТекЭлем.Ключ,,СтрЗаменить(ТекЭлем.Ключ,"Колонка",""));
		КонецЦикла;
		
		Прервать; //из 1 строки забрали колонки. Дальше нет нужды двигаться по циклу
	КонецЦикла;
	
	Для Каждого ТекСтр из ДанныеДляЗагрузки Цикл
		НоваяСтрока = ТЗ.Добавить();
		
		Для Каждого ТекЭлем Из ТекСтр Цикл
			НоваяСтрока[ТекЭлем.Ключ] = ТекЭлем.Значение;			
		КонецЦикла; 		
		
	КонецЦикла;
	
	Возврат ТЗ;
КонецФункции

Функция ПолучитьДату(ДатаСтрока) 
	Возврат СтроковыеФункцииКлиентСервер.СтрокаВДату(Лев(ДатаСтрока,10));
КонецФункции

Функция ЗаполнитьСтатическиеРеквизиты(СтатическиеКолонки,Статика,Колонки,ТекСтрока)
	
	ЗначенияСтатическихКолонок = новый Структура;
	ЗначенияСтатическихКолонок.Вставить("IDСтроки",Новый УникальныйИдентификатор);
	
	Для Каждого ТекСоот из Статика Цикл
		СтатКолонка = СтатическиеКолонки.Получить(ТекСоот.Значение);
		Если СтатКолонка = Неопределено Тогда
			Продолжить;
		КонецЕсли; 		
			
		Если СтатКолонка.ТипЗнч = Тип("Дата") Тогда
			Значение = ПолучитьДату(ТекСтрока["Колонка" + ТекСоот.Ключ]);
		Иначе
			Значение = ТекСтрока["Колонка" + ТекСоот.Ключ];
		КонецЕсли;
		
		ЗначенияСтатическихКолонок.Вставить(ТекСоот.Значение,Значение);
	КонецЦикла;
	
	Возврат ЗначенияСтатическихКолонок
КонецФункции

#КонецОбласти

#КонецЕсли
